CSI API ETABS v1

# cSapModelAreaObj Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cAreaObj AreaObj { get; }

    ReadOnly Property AreaObj As cAreaObj
    	Get

    Dim instance As cSapModel
    Dim value As cAreaObj

    value = instance.AreaObj

    property cAreaObj^ AreaObj {
    	cAreaObj^ get ();
    }

    abstract AreaObj : cAreaObj with get

#### Property Value

Type: cAreaObj

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com